{
  "oni": {
    "acronym": "ONI",
    "full_name": "Open Neurosecurity Interoperability",
    "name": "ONI Framework",
    "tagline": "The OSI of Mind",
    "slogan": "Life's most important connections deserve the most thought.",
    "mission": "The power of mind is our frontier. We're making sure it's protected from day one with a universal, open standard that leaves no brain behind.",
    "description": "A unified 14-layer model extending OSI into the biological domain. One framework to understand, build, and secure brain-computer interfaces. Open. Extensible. Universal.",
    "version": "0.2.2",
    "vision": "A world where brain-computer interfaces are as secure as they are powerful. Where neural data is protected by law and by design. Where the boundary between mind and machine is guarded by open standards, with security built in from inception."
  },
  "tara": {
    "acronym": "TARA",
    "full_name": "Telemetry Analysis & Response Automation",
    "name": "TARA Platform",
    "tagline": "Protection for the neural frontier",
    "slogan": "Named after the Buddhist goddess of protection.",
    "mission": "Provide real-time neural security monitoring, attack simulation, and response automation aligned with the ONI 14-layer model.",
    "description": "A neural security platform for BCI security monitoring, simulation, and attack testing. Real-time security analysis for brain-computer interfaces.",
    "version": "0.8.1"
  },
  "stats": {
    "_comment": "Manual stats only. Auto-updating stats (commits, tools) are fetched via GitHub API in docs/index.html",
    "security_layers": 14,
    "threat_signatures": 25,
    "learning_portals": 1
  },
  "_meta": {
    "last_updated": "2026-01-26",
    "location": "MAIN/resources/brand.json",
    "consumers": [
      "MAIN/oni-framework/oni/brand.py",
      "MAIN/tara-nsec-platform/tara_mvp/_brand.py",
      "MAIN/oni-academy/oni_academy/_brand.py",
      "docs/index.html"
    ],
    "note": "Single source of truth for all ONI project branding and stats"
  }
}
